-- 고객 테이블에서 고객아이디, 고객이름, 등급 속성을 검색해보자.
select  고객아이디, 고객이름, 등급 속성 from 고객;

--고객 테이블에 존재하는 모든 속성을 검색해보자.
select  고객아이디, 고객이름, 나이, 등급, 직업, 적립금 from 고객; 

--고객 테이블에 존재하는 모든 속성을 검색해보자.
select * from 고객; 

-- 제품 테이블에서 제조업체를 검색해보자.
select 제조업체 from 제품; 

-- 제품 테이블에서 제조업체를 검색하되, ALl키워드를 사용해보자.
select all 제조업체 from 제품; 

-- 제품 테이블에서 제조업체 속성을 중복 없이 검색해보자.
select distinct 제조업체 from 제품; 

-- 제품 테이블에서 제품명과 단가 속성을 검색하되, 단가를 가격이라는 새 이름으로 출력해보자.
select 제품명, 단가 as 가격 from 제품; 

-- 제품 테이블에서 제품명과 단가 속성을 검색하되, 단가에 500원을 더해 "조정 단가"라는 새 이름으로 출력해보자.
select 제품명, 단가 + 500 as "조정 단가" from 제품; 

-- 제품 테이블에서 한빛제과가 제조한 제품의 제품명, 재고량, 단가를 검색해보자.
select all 제품명, 재고량, 단가 from 제품 where 제조업체 = '한빛제과';

-- 주문 테이블에서 apple 고객이 15개 이상 주문한 주문제품, 수량, 주문일자를 검색해보자.
select 주문제품, 수량, 주문일자 from 주문 where 주문고객 = 'apple' AND 수량 >= 15;

-- 주문 테이블에서 apple 고객이 주문했거나 15개 이상 주문된 제품의 주문제품, 수량, 주문일자, 주문고객을 검색해보자.
select 주문제품, 수량, 주문일자 from 주문 where 주문고객 = 'apple' OR 수량 >= 15;

-- 7-21: 제품 테이블에서 단가가 2000원 이상이면서 3000원 이하인 제품의 제품명, 단가, 제조업체를 검색해보자.
select 제품명, 단가, 제조업체 from 제품 where 단가 >= 2000 AND 단가 <= 3000;

-- 7-22: 고객 테이블에서 성이 김 씨인 고객의 고객이름, 나이, 등급, 적립금을 검색해보자.
select 고객이름, 나이, 등급, 적립금 from 고객 where 고객이름 like '김%';

-- 7-23: 고객 테이블에서 고객아이디가 5자인 고객의 고객아이디, 고객이름, 등급을 검색해보자.
select 고객아이디, 고객이름, 등급 from 고객 where 고객아이디 like '_____';

-- 7-24: 고객 테이블에서 나이가 아직 입력되지 않은 고객의 고객이름을 검색해보자.
select 고객이름 from 고객 where 나이 is null;

-- 7-25: 고객 테이블에서 나이가 이미 입력된 고객의 고객이름을 검색해보자.
select 고객이름 from 고객 where 나이 is not null;